# Brewfile - Homebrew Bundle for dotfiles
# This file manages all packages, casks, and applications
# Install with: brew bundle install
# Update with: brew bundle install --cleanup

# Core Development Tools
brew "git"
brew "jq"              # JSON processor
brew "yq"              # YAML processor

# Modern CLI Tools (Rust-based replacements)
brew "ripgrep"         # Better grep (rg)
brew "fd"              # Better find
brew "bat"             # Better cat with syntax highlighting
brew "eza"             # Better ls
brew "zoxide"          # Smart cd that learns your habits
brew "fzf"             # Fuzzy finder
brew "dust"            # Better du (disk usage)
brew "bottom"          # Better top (btm)
brew "procs"           # Better ps
brew "sd"              # Better sed
brew "hyperfine"       # Benchmarking tool
brew "tokei"           # Code statistics

# Shell Enhancements
brew "starship"            # Modern cross-shell prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# File Management
brew "trash"           # Safe rm alternative

# Development Tools
brew "uv"              # Fast Python package installer and resolver
brew "chezmoi"         # Dotfiles manager
brew "gh"              # GitHub CLI
brew "git-delta"       # Better git diffs with syntax highlighting

# Optional: Uncomment if you need these
# brew "neovim"        # Modern vim
# brew "tmux"          # Terminal multiplexer
# brew "docker"        # Container runtime

# GUI Applications (casks)
cask "alacritty"           # GPU-accelerated terminal

# Optional GUI Applications
# Uncomment the ones you need
cask "visual-studio-code"
cask "google-chrome"
# cask "iterm2"
# cask "firefox"
# cask "slack"
# cask "docker"

# Fonts
cask "font-fira-code-nerd-font"  # Programming font with ligatures and icons

# Mac App Store apps (requires mas CLI)
# brew "mas"
# mas "Xcode", id: 497799835
